simonwong201293/Task-aware-Framework-using-Machine-Learning-for-Long-lasting-Green-IoT-Sensing-Devices/nRF5SDK15/nRF5_SDK_15.3.0_59ac345/examples/ble_peripheral/ble_app_template/main.c
    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated when button is pressed.
 */
static void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;

    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break; // BSP_EVENT_SLEEP

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break; // BSP_EVENT_DISCONNECT

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break; // BSP_EVENT_KEY_0

        default:
            break;
    }
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for application main entry.
 */
float32_t autoencoder_input[2][24] = {{0.0013888888888888, 0.0486111111111111, 0.105, 0.2875, 0.3455555555555555, 0.2430555555555555, 0.0930555555555555, 0.1275, 0.1408333333333333, 0.1616666666666666, 0.1563888888888888, 0.1288888888888889, 0.2055555555555555, 0.1083333333333333, 0.3377777777777778, 0.3594444444444444, 0.2836111111111111, 0.2805555555555555, 0.2411111111111111, 0.2058333333333333, 0.07, 0.0075, 0.0, 0.0}, {0.0486111111111111, 0.105, 0.2875, 0.3455555555555555, 0.2430555555555555, 0.0930555555555555, 0.1275, 0.1408333333333333, 0.1616666666666666, 0.1563888888888888, 0.1288888888888889, 0.2055555555555555, 0.1083333333333333, 0.3377777777777778, 0.3594444444444444, 0.2836111111111111, 0.2805555555555555, 0.2411111111111111, 0.2058333333333333, 0.07, 0.0075, 0.0, 0.0, 0.0}};
float32_t test_autoencoder_output[2][24] = {{0.0057076514, 0.03554231, 0.12045413, 0.27880654, 0.3265516, 0.2565335, 0.14578363, 0.10708693, 0.14240226, 0.17362955, 0.15775105, 0.12838939, 0.14726415, 0.20921892, 0.278468, 0.31538308, 0.30779886, 0.29204625, 0.25185615, 0.15900773, 0.0639846, 0.015490264, 0.0040723383, 0.0018996596}, {0.0275127, 0.13549066, 0.2630511, 0.31288317, 0.20873457, 0.1504927, 0.13089404, 0.13099733, 0.15856823, 0.16726542, 0.15196583, 0.14367372, 0.19207805, 0.29515812, 0.35285497, 0.32674325, 0.2788528, 0.24104017, 0.16599804, 0.07676998, 0.02590093, 0.0065592527, 0.0024288893, 0.002079308}};
float32_t cn_input1[2][24] = {{-1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0}, {-1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0, -1.0}};
float32_t cn_input2[2][24] = {{0.0057076514, 0.03554231, 0.12045413, 0.27880654, 0.3265516, 0.2565335, 0.14578363, 0.10708693, 0.14240226, 0.17362955, 0.15775105, 0.12838939, 0.14726415, 0.20921892, 0.278468, 0.31538308, 0.30779886, 0.29204625, 0.25185615, 0.15900773, 0.0639846, 0.015490264, 0.0040723383, 0.0018996596}, {0.0275127, 0.13549066, 0.2630511, 0.31288317, 0.20873457, 0.1504927, 0.13089404, 0.13099733, 0.15856823, 0.16726542, 0.15196583, 0.14367372, 0.19207805, 0.29515812, 0.35285497, 0.32674325, 0.2788528, 0.24104017, 0.16599804, 0.07676998, 0.02590093, 0.0065592527, 0.0024288893, 0.002079308}};
float32_t cn_input3[2][24] = {{0.032197386, 0.0018995106, 0.00053319335, 0.0015017986, 0.00014525652, 0.002870977, 9.343478e-05, 0.00022405386, 8.6600405e-05, 0.00022861362, 5.2571406e-05, 0.45098603, 0.0009728372, 0.00013136864, 0.010519564, 0.30991918, 0.00035598874, 0.0004940331, 2.66085e-05, 0.0002488792, 0.000195086, 0.0011582971, 0.003066808, 0.99688655}, {0.053211182, 0.003960818, 0.001134038, 0.003207475, 0.00044319034, 0.005401641, 0.00033593178, 0.00072842836, 0.00035867095, 0.0006699264, 0.00023189187, 0.49357045, 0.0021690428, 0.0004107654, 0.013713032, 0.30570346, 0.0010406077, 0.0013284683, 0.00011452903, 0.0006660223, 0.000659585, 0.003743589, 0.0055596232, 0.9913663}};
float32_t cn_input4[2][24] = {{0.48346314, 0.0041406453, 0.0017468631, 0.005259633, 0.07740104, 0.0014466941, 0.008315504, 0.008601874, 0.0066212416, 0.0010651052, 0.0038691163, 0.03833404, 0.014942944, 0.0034784079, 0.024334282, 0.020576328, 0.011247873, 0.003943473, 0.071929544, 0.021533966, 0.041917026, 0.01359567, 0.21388102, 0.95732725}, {0.47080976, 0.0130209625, 0.008239955, 0.014147013, 0.14800861, 0.0068023503, 0.029045552, 0.023219109, 0.023931593, 0.0061238706, 0.014323741, 0.080230355, 0.039050102, 0.012321472, 0.053602755, 0.042322487, 0.02952692, 0.013228208, 0.120141536, 0.04929325, 0.09427881, 0.036504984, 0.26896638, 0.882855}};
float32_t test_cn_output[2][1] = {{0.008346151}, {0.016429355}};
float32_t pc_attn_input1[2][24] = {{0.0013888888888888, 0.0486111111111111, 0.105, 0.2875, 0.3455555555555555, 0.2430555555555555, 0.0930555555555555, 0.1275, 0.1408333333333333, 0.1616666666666666, 0.1563888888888888, 0.1288888888888889, 0.2055555555555555, 0.1083333333333333, 0.3377777777777778, 0.3594444444444444, 0.2836111111111111, 0.2805555555555555, 0.2411111111111111, 0.2058333333333333, 0.07, 0.0075, 0.0, 0.0}, {0.0486111111111111, 0.105, 0.2875, 0.3455555555555555, 0.2430555555555555, 0.0930555555555555, 0.1275, 0.1408333333333333, 0.1616666666666666, 0.1563888888888888, 0.1288888888888889, 0.2055555555555555, 0.1083333333333333, 0.3377777777777778, 0.3594444444444444, 0.2836111111111111, 0.2805555555555555, 0.2411111111111111, 0.2058333333333333, 0.07, 0.0075, 0.0, 0.0, 0.0}};
float32_t pc_attn_input2[2][24] = {{0.0057076514, 0.03554231, 0.12045413, 0.27880654, 0.3265516, 0.2565335, 0.14578363, 0.10708693, 0.14240226, 0.17362955, 0.15775105, 0.12838939, 0.14726415, 0.20921892, 0.278468, 0.31538308, 0.30779886, 0.29204625, 0.25185615, 0.15900773, 0.0639846, 0.015490264, 0.0040723383, 0.0018996596}, {0.0275127, 0.13549066, 0.2630511, 0.31288317, 0.20873457, 0.1504927, 0.13089404, 0.13099733, 0.15856823, 0.16726542, 0.15196583, 0.14367372, 0.19207805, 0.29515812, 0.35285497, 0.32674325, 0.2788528, 0.24104017, 0.16599804, 0.07676998, 0.02590093, 0.0065592527, 0.0024288893, 0.002079308}};
float32_t test_pc_attn_output[2][1] = {{0.008539623}, {0.017253388}};

unsigned int n = 0x3F800000;

float32_t test_val[1] = {0x3F800000};
float32_t test_val2 = 1.0f;
#undef ARM_MATH_MATRIX_CHECK
int main(void)
{
	
    bool erase_bonds;
    // Initialize.
    log_init();
		//multiplication_test();
		//sigmoid_test();
		test_val[0] = *((float*)&n);
	
		volatile uint32_t count = 0;
		// enable the use DWT
    CoreDebug->DEMCR |= 0x01000000;
		// Reset cycle counter
		DWT->CYCCNT = 0;
		// enable cycle counter
		DWT->CTRL |= 0x1;
		float a = 1.0 + 1.0;
		// number of cycles stored in count variable
		count = DWT->CYCCNT;
		NRF_LOG_INFO("Clock cycle for 1+1: %d", count);
	
		// Reset cycle counter
		DWT->CYCCNT = 0;
		// enable cycle counter
		DWT->CTRL |= 0x1;
		float32_t autoencoder_output[2][24];
		for(int i = 0; i < 1; i++){
			autoencode((float32_t *)autoencoder_input[i], (float32_t *)autoencoder_output[i]);
		}
		// number of cycles stored in count variable
		count = DWT->CYCCNT;
		NRF_LOG_INFO("Clock cycle for autoencoder: %d", count);
		
		// Reset cycle counter
		DWT->CYCCNT = 0;
		// enable cycle counter
		DWT->CTRL |= 0x1;
		float32_t cn_output[2][1];
		for(int i = 0; i < 1; i++){
			cn(cn_input1[i], cn_input2[i], cn_input3[i], cn_input4[i], cn_output[i]);
		}
		// number of cycles stored in count variable
		count = DWT->CYCCNT;
		NRF_LOG_INFO("Clock cycle for CN: %d", count);
		
		// Reset cycle counter
		DWT->CYCCNT = 0;
		// enable cycle counter
		DWT->CTRL |= 0x1;
		float32_t pc_attn_output[2][1];
		for(int i = 0; i < 1; i++){
			pc_attn(pc_attn_input1[i], pc_attn_input2[i], pc_attn_output[i]);
		}
		// number of cycles stored in count variable
		count = DWT->CYCCNT;
		NRF_LOG_INFO("Clock cycle for PCN: %d", count);
		
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    conn_params_init();
    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("Template example started.");
    application_timers_start();

    advertising_start(erase_bonds);

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
